Show / Hide Table of Contents
Class ConnectionHiddenCheckClient
Inheritance
System.Object
System.ServiceModel.ClientBase<IConnHiddenCheck>
ConnectionHiddenCheckClient
Implements
System.ServiceModel.ICommunicationObject
System.IDisposable
IConnHiddenCheck
Inherited Members
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IConnHiddenCheck>.GetDefaultValueForInitialization<T>()
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IConnHiddenCheck>.Open()
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IConnHiddenCheck>.Abort()
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IConnHiddenCheck>.Close()
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IConnHiddenCheck>.DisplayInitializationUI()
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IConnHiddenCheck>.CreateChannel()
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IConnHiddenCheck>.System.IDisposable.Dispose()
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IConnHiddenCheck>.System.ServiceModel.ICommunicationObject.Open(System.TimeSpan)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IConnHiddenCheck>.System.ServiceModel.ICommunicationObject.Close(System.TimeSpan)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IConnHiddenCheck>.System.ServiceModel.ICommunicationObject.BeginClose(System.AsyncCallback, System.Object)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IConnHiddenCheck>.System.ServiceModel.ICommunicationObject.BeginClose(System.TimeSpan, System.AsyncCallback, System.Object)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IConnHiddenCheck>.System.ServiceModel.ICommunicationObject.EndClose(System.IAsyncResult)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IConnHiddenCheck>.System.ServiceModel.ICommunicationObject.BeginOpen(System.AsyncCallback, System.Object)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IConnHiddenCheck>.System.ServiceModel.ICommunicationObject.BeginOpen(System.TimeSpan, System.AsyncCallback, System.Object)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IConnHiddenCheck>.System.ServiceModel.ICommunicationObject.EndOpen(System.IAsyncResult)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IConnHiddenCheck>.InvokeAsync(System.ServiceModel.ClientBase.BeginOperationDelegate<>, System.Object[], System.ServiceModel.ClientBase.EndOperationDelegate<>, System.Threading.SendOrPostCallback, System.Object)
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IConnHiddenCheck>.Channel
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IConnHiddenCheck>.CacheSetting
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IConnHiddenCheck>.ChannelFactory
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IConnHiddenCheck>.ClientCredentials
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IConnHiddenCheck>.State
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IConnHiddenCheck>.InnerChannel
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IConnHiddenCheck>.Endpoint
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IConnHiddenCheck>.System.ServiceModel.ICommunicationObject.Closed
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IConnHiddenCheck>.System.ServiceModel.ICommunicationObject.Closing
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IConnHiddenCheck>.System.ServiceModel.ICommunicationObject.Faulted
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IConnHiddenCheck>.System.ServiceModel.ICommunicationObject.Opened
 System.ServiceModel.ClientBase<IdeaStatiCa.Plugin.IConnHiddenCheck>.System.ServiceModel.ICommunicationObject.Opening
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public class ConnectionHiddenCheckClient : ClientBase<IConnHiddenCheck>, ICommunicationObject, IDisposable, IConnHiddenCheck
Constructors
Improve this Doc   View Source
ConnectionHiddenCheckClient(Binding, EndpointAddress)
Declaration
public ConnectionHiddenCheckClient(Binding binding, EndpointAddress remoteAddress)
Parameters
 Type |  Name |  Description
 System.ServiceModel.Channels.Binding |  binding
 System.ServiceModel.EndpointAddress |  remoteAddress
Properties
Improve this Doc   View Source
HiddenCalculatorId
Declaration
public static int HiddenCalculatorId { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Service
Declaration
protected IConnHiddenCheck Service { get; }
Property Value
 Type |  Description
 IConnHiddenCheck
Methods
Improve this Doc   View Source
AddBoltAssembly(String)
Declaration
public int AddBoltAssembly(string boltAssemblyName)
Parameters
 Type |  Name |  Description
 System.String |  boltAssemblyName
Returns
 Type |  Description
 System.Int32
Improve this Doc   View Source
ApplyParameters(String, String)
Declaration
public string ApplyParameters(string connectionId, string parametersJSON)
Parameters
 Type |  Name |  Description
 System.String |  connectionId
 System.String |  parametersJSON
Returns
 Type |  Description
 System.String
Improve this Doc   View Source
ApplySimpleTemplate(String, String, ApplyConnTemplateSetting, Int32, List<Int32>)
Declaration
public string ApplySimpleTemplate(string connectionId, string templateFilePath, ApplyConnTemplateSetting connTemplateSetting, int mainMember, List<int> attachedMembers)
Parameters
 Type |  Name |  Description
 System.String |  connectionId
 System.String |  templateFilePath
 ApplyConnTemplateSetting |  connTemplateSetting
 System.Int32 |  mainMember
 System.Collections.Generic.List<System.Int32> |  attachedMembers
Returns
 Type |  Description
 System.String
Improve this Doc   View Source
ApplyTemplate(String, String, ApplyConnTemplateSetting)
Declaration
public string ApplyTemplate(string connectionId, string conTemplateFileName, ApplyConnTemplateSetting connTemplateSetting)
Parameters
 Type |  Name |  Description
 System.String |  connectionId
 System.String |  conTemplateFileName
 ApplyConnTemplateSetting |  connTemplateSetting
Returns
 Type |  Description
 System.String
Improve this Doc   View Source
Calculate(String)
Declaration
public ConnectionResultsData Calculate(string connectionId)
Parameters
 Type |  Name |  Description
 System.String |  connectionId
Returns
 Type |  Description
 ConnectionResultsData
Improve this Doc   View Source
Cancel()
Declaration
public void Cancel()
Improve this Doc   View Source
CloseProject()
Declaration
public void CloseProject()
Improve this Doc   View Source
CreateConProjFromIOM(String, String, String)
Declaration
public void CreateConProjFromIOM(string iomXmlFileName, string iomResXmlFileName, string newIdeaConFileName)
Parameters
 Type |  Name |  Description
 System.String |  iomXmlFileName
 System.String |  iomResXmlFileName
 System.String |  newIdeaConFileName
Improve this Doc   View Source
EvaluateExpression(String, String, String)
Declaration
public string EvaluateExpression(string connectionId, string expression, string arumentsJSON)
Parameters
 Type |  Name |  Description
 System.String |  connectionId
 System.String |  expression
 System.String |  arumentsJSON
Returns
 Type |  Description
 System.String
Improve this Doc   View Source
ExportToTemplate(String, String)
Declaration
public string ExportToTemplate(string connectionId, string conTemplateFileName)
Parameters
 Type |  Name |  Description
 System.String |  connectionId
 System.String |  conTemplateFileName
Returns
 Type |  Description
 System.String
Improve this Doc   View Source
GetAllConnectionData(String)
Declaration
public string GetAllConnectionData(string connectionId)
Parameters
 Type |  Name |  Description
 System.String |  connectionId
Returns
 Type |  Description
 System.String
Improve this Doc   View Source
GetBoltAssembliesInProject()
Declaration
public List<ProjectItem> GetBoltAssembliesInProject()
Returns
 Type |  Description
 System.Collections.Generic.List<ProjectItem>
Improve this Doc   View Source
GetConnectionLoadingJSON(String)
Declaration
public string GetConnectionLoadingJSON(string connectionId)
Parameters
 Type |  Name |  Description
 System.String |  connectionId
Returns
 Type |  Description
 System.String
Improve this Doc   View Source
GetConnectionModel(String)
Declaration
public ConnectionData GetConnectionModel(string connectionId)
Parameters
 Type |  Name |  Description
 System.String |  connectionId
Returns
 Type |  Description
 ConnectionData
Improve this Doc   View Source
GetConnectionModelXML(String)
Declaration
public string GetConnectionModelXML(string connectionId)
Parameters
 Type |  Name |  Description
 System.String |  connectionId
Returns
 Type |  Description
 System.String
Improve this Doc   View Source
GetCrossSectionsInProject()
Declaration
public List<ProjectItem> GetCrossSectionsInProject()
Returns
 Type |  Description
 System.Collections.Generic.List<ProjectItem>
Improve this Doc   View Source
GetCheckResultsJSON(String)
Declaration
public string GetCheckResultsJSON(string connectionId)
Parameters
 Type |  Name |  Description
 System.String |  connectionId
Returns
 Type |  Description
 System.String
Improve this Doc   View Source
GetMaterialsInProject()
Declaration
public List<ProjectItem> GetMaterialsInProject()
Returns
 Type |  Description
 System.Collections.Generic.List<ProjectItem>
Improve this Doc   View Source
GetParametersJSON(String)
Declaration
public string GetParametersJSON(string connectionId)
Parameters
 Type |  Name |  Description
 System.String |  connectionId
Returns
 Type |  Description
 System.String
Improve this Doc   View Source
GetProjectInfo()
Declaration
public ConProjectInfo GetProjectInfo()
Returns
 Type |  Description
 ConProjectInfo
Improve this Doc   View Source
OpenProject(String)
Declaration
public void OpenProject(string ideaConFileName)
Parameters
 Type |  Name |  Description
 System.String |  ideaConFileName
Improve this Doc   View Source
SaveAsProject(String)
Declaration
public void SaveAsProject(string newProjectFileName)
Parameters
 Type |  Name |  Description
 System.String |  newProjectFileName
Improve this Doc   View Source
UpdateLoadingFromJson(String, String)
Declaration
public string UpdateLoadingFromJson(string connectionId, string loadingJSON)
Parameters
 Type |  Name |  Description
 System.String |  connectionId
 System.String |  loadingJSON
Returns
 Type |  Description
 System.String
Implements
 System.ServiceModel.ICommunicationObject
 System.IDisposable
 IConnHiddenCheck
 Improve this Doc
 View Source